БылковДА_70180166/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <basedOn>Document.НаправлениеНаПересдачу</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НаправлениеНаПересдачу</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Дата,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Дисциплина,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.ДокументОснование,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Номер,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Преподаватель,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.РольВКомиссии,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Семестр,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Факультет,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.ЧасыРаботы,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.НазначениеСтудентаДляПреподавателя.(
	|		НомерСтроки,
	|		Студент
	|	)
	|ИЗ
	|	Документ.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей КАК ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей
	|ГДЕ
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНазначениеСтудентаДляПреподавателяШапка = Макет.ПолучитьОбласть("НазначениеСтудентаДляПреподавателяШапка");
	ОбластьНазначениеСтудентаДляПреподавателя = Макет.ПолучитьОбласть("НазначениеСтудентаДляПреподавателя");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНазначениеСтудентаДляПреподавателяШапка);
		ВыборкаНазначениеСтудентаДляПреподавателя = Выборка.НазначениеСтудентаДляПреподавателя.Выбрать();
		Пока ВыборкаНазначениеСтудентаДляПреподавателя.Следующий() Цикл
			ОбластьНазначениеСтудентаДляПреподавателя.Параметры.Заполнить(ВыборкаНазначениеСтудентаДляПреподавателя);
			ТабДок.Вывести(ОбластьНазначениеСтудентаДляПреподавателя, ВыборкаНазначениеСтудентаДляПреподавателя.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
